[
  {
    "id": "jengahacks-2026-what-to-expect",
    "title": "JengaHacks 2026: What to Expect",
    "excerpt": "Get ready for East Africa's premier hackathon. Here's what's coming to JengaHacks 2026 and why you should be excited.",
    "content": "<p>JengaHacks is back in 2026, and it is shaping up to be our biggest and most exciting year yet. Whether you are a first-time hacker or a returning participant, this year's event is designed to help you build meaningful projects, connect with great people, and walk away with real skills.</p><p>Here is what you can expect.</p><h2>A Hackathon Built for Builders</h2><p>JengaHacks was created to be accessible, practical, and welcoming. We focus less on flashy demos and more on ideas that solve real problems.</p><p>In 2026, you can expect:</p><ul><li>A supportive environment for beginners</li><li>Challenging tracks for experienced builders</li><li>Mentors who care about helping you succeed</li><li>Clear judging criteria and transparent feedback</li></ul><p>Our goal is simple. If you show up curious and ready to learn, you belong here.</p><h2>2026 Tracks</h2><p>This year's tracks are designed around real-world impact and modern technology. Teams can choose the track that best fits their interests or mix ideas across tracks.</p><h3>🌍 Social Impact and Sustainability</h3><p>Build solutions that address challenges in health, education, climate, agriculture, or access to services. Projects in this track should focus on real people and real outcomes.</p><h3>💼 Fintech and Digital Economy</h3><p>Explore payments, financial inclusion, small business tools, or new ways to support the growing digital economy across Africa.</p><h3>🤖 AI and Emerging Tech</h3><p>Use machine learning, data, or automation to solve problems creatively and responsibly. Strong projects clearly explain how AI improves the solution, not just that it uses it.</p><h3>🎓 Student Innovation</h3><p>A space for newer hackers and students to experiment, learn, and build confidently. This track emphasizes learning, creativity, and execution over complexity.</p><h2>Prizes That Actually Matter</h2><p>Winning is exciting, but we believe prizes should help teams keep going after the hackathon ends.</p><p>For JengaHacks 2026, prizes may include:</p><ul><li>Cash awards</li><li>Cloud credits and developer tools</li><li>Mentorship and startup support</li><li>Opportunities to showcase your project publicly</li></ul><p>More details will be announced closer to the event.</p><h2>Mentors, Workshops, and Support</h2><p>You will not be building alone.</p><p>Throughout the weekend, participants will have access to:</p><ul><li>Technical mentors</li><li>Design and product guidance</li><li>Short workshops on pitching, teamwork, and rapid prototyping</li><li>Office hours to unblock stuck teams</li></ul><p>Mentors are there to help, not judge. Ask questions early and often.</p><h2>How Teams and Judging Work</h2><p>Teams can be formed ahead of time or at the event. Most teams are between two and four people.</p><p>Judging focuses on:</p><ul><li>Problem clarity</li><li>Quality of solution</li><li>Execution and usability</li><li>Impact and feasibility</li><li>Presentation</li></ul><p>You do not need a perfect product. You need a clear idea and a working demo.</p><h2>Who Should Apply</h2><p>JengaHacks is open to:</p><ul><li>Students</li><li>Early-career developers</li><li>Designers and product thinkers</li><li>Anyone curious about building technology</li></ul><p>You do not need prior hackathon experience. You just need the willingness to try.</p><h2>Key Dates and Next Steps</h2><p>Applications, full schedules, and partner announcements will be shared soon. Keep an eye on our website and social channels for updates.</p><p>If you are thinking about joining, now is a great time to start:</p><ul><li>Brushing up on a new tool</li><li>Talking with friends about ideas</li><li>Getting excited about building something new</li></ul><h2>Final Thoughts</h2><p>JengaHacks 2026 is about more than a weekend of coding. It is about learning fast, meeting people who care, and building things that matter.</p><p>We cannot wait to see what you create.</p>",
    "author": "JengaHacks Team",
    "publishedAt": "2025-12-15T08:00:00Z",
    "readTime": 5,
    "tags": ["announcement", "event", "tracks", "2026"],
    "imageUrl": "/city-skyline.svg"
  },
  {
    "id": "registration-now-open-2026",
    "title": "Registration Now Open: Secure Your Spot",
    "excerpt": "Registration for JengaHacks 2026 is now open! Limited to 200 participants. Don't miss out on this incredible opportunity.",
    "content": "<p>Registration for JengaHacks 2026 is officially open.</p><p>If you are planning to join us this year, now is the time to sign up. Participation is limited to 200 spots, and registration will close once capacity is reached.</p><h2>Why Register Early</h2><p>JengaHacks brings together builders, designers, and problem solvers from across East Africa and beyond. Spots tend to fill quickly, especially as teams begin forming and tracks are announced.</p><p>By registering early, you:</p><ul><li>Guarantee your place at the event</li><li>Get early access to updates and announcements</li><li>Have more time to form or join a team</li><li>Can start preparing ideas and tools ahead of time</li></ul><h2>Who Can Register</h2><p>JengaHacks is open to:</p><ul><li>Students and recent graduates</li><li>Software developers and engineers</li><li>Designers, product thinkers, and creators</li><li>Anyone excited to build and learn</li></ul><p>You do not need prior hackathon experience. Beginners are welcome and encouraged to apply.</p><h2>What's Next</h2><p>More details about tracks, mentors, prizes, and the full event schedule will be shared soon. Registered participants will be the first to receive updates.</p><p>Spots are limited, and once they are gone, registration will close.</p><h2>Ready to Join?</h2><p>If you have been thinking about participating, this is your sign. JengaHacks 2026 is shaping up to be an exciting weekend of building, learning, and collaboration.</p><p>Register now and secure your spot.</p>",
    "author": "JengaHacks Team",
    "publishedAt": "2025-12-21T08:00:00Z",
    "readTime": 2,
    "tags": ["registration", "announcement"],
    "videoUrl": "/Nairobi.mov"
  },
  {
    "id": "welcome-to-jengahacks-2026",
    "title": "Welcome to JengaHacks 2026",
    "excerpt": "East Africa's biggest student-led hackathon is back! Join us for an incredible weekend of building, learning, and networking.",
    "content": "<p>Welcome to JengaHacks 2026.</p><p>We are excited to officially welcome you to this year's hackathon. Whether you are joining for the first time or returning after a past event, JengaHacks 2026 is designed to be a space where ideas turn into real projects and people grow as builders.</p><p>This is a weekend about learning fast, collaborating openly, and building things that matter.</p><h2>What Is JengaHacks?</h2><p>JengaHacks is a community-focused hackathon bringing together students, developers, designers, and problem solvers from across Kenya and beyond.</p><p>It is not just about competition. It is about:</p><ul><li>Solving real problems</li><li>Learning by doing</li><li>Meeting people who care about building technology</li><li>Gaining confidence in your skills</li></ul><p>You do not need to be an expert to belong here. Curiosity and effort matter more than experience.</p><h2>What to Expect During the Event</h2><p>Over the course of the hackathon, participants will:</p><ul><li>Form teams or work solo</li><li>Choose a problem to focus on</li><li>Build a working project in a limited time</li><li>Get feedback from mentors</li><li>Present their work to judges and peers</li></ul><p>There will be structured moments to help you stay on track, along with flexibility to work in a way that suits your team. Mentors will be available throughout the event to help unblock challenges, answer questions, and offer guidance.</p><h2>Who Should Participate</h2><p>JengaHacks 2026 is open to:</p><ul><li>Students and recent graduates</li><li>Software engineers and developers</li><li>Designers, product thinkers, and creatives</li><li>Anyone interested in learning how to build technology</li></ul><p>You do not need prior hackathon experience. Many participants join to learn something new or to try building their first project from scratch.</p><h2>Our Values</h2><p>We care deeply about creating a welcoming and supportive environment.</p><p>At JengaHacks, we value:</p><ul><li>Inclusivity and respect</li><li>Collaboration over competition</li><li>Learning over perfection</li><li>Clear communication and teamwork</li></ul><p>Our goal is for every participant to leave feeling more confident and capable than when they arrived.</p><h2>How to Prepare</h2><p>If you are registered, there are a few simple ways to prepare:</p><ul><li>Think about problems you care about</li><li>Explore tools or technologies you want to try</li><li>Talk with friends about forming a team</li><li>Come ready to learn and experiment</li></ul><p>You do not need to have everything planned ahead of time. Many of the best ideas come together during the event itself.</p><h2>What's Coming Next</h2><p>In the coming weeks, we will share:</p><ul><li>Event tracks</li><li>Mentor announcements</li><li>Prize details</li><li>The full schedule</li></ul><p>Registered participants will receive updates first, so keep an eye on your email.</p><h2>Final Thoughts</h2><p>JengaHacks 2026 is about building, learning, and connecting with people who want to create positive change through technology.</p><p>We are glad you are here. We cannot wait to see what you build.</p>",
    "author": "JengaHacks Team",
    "publishedAt": "2025-12-23T10:00:00Z",
    "readTime": 5,
    "tags": ["announcement", "event"],
    "videoUrl": "/Typing2.mov",
    "imageUrl": "/blog-welcome.svg"
  },
  {
    "id": "meet-our-sponsors-2026",
    "title": "Meet Our Sponsors: Building the Future Together",
    "excerpt": "We're thrilled to introduce our amazing sponsors who are making JengaHacks 2026 possible.",
    "content": "<p>We are excited to introduce the sponsors helping make JengaHacks 2026 possible.</p><p>JengaHacks is a community-driven event, and it would not exist without partners who believe in supporting builders, students, and innovators. Our sponsors play a key role in creating an accessible, high-quality hackathon experience.</p><h2>Silicon Savannah Solutions</h2><p>Silicon Savannah Solutions supports startups by connecting them with skilled software engineers and technical talent in Kenya. Their work focuses on building strong, sustainable teams and creating real opportunities for developers to grow.</p><p>As a sponsor, Silicon Savannah Solutions brings a deep commitment to mentorship, skills development, and practical technology solutions. Their support helps ensure JengaHacks remains focused on real-world impact and learning.</p><h2>Adamur</h2><p>Adamur is dedicated to building tools and platforms that empower people to work smarter and more efficiently. With a focus on thoughtful product design and usability, Adamur aligns closely with the values of JengaHacks.</p><p>Their support helps provide participants with resources, guidance, and inspiration to turn ideas into working products.</p><h2>PromptBI</h2><p>PromptBI helps teams turn data into clear insights through modern analytics and business intelligence tools. Their work makes it easier for organizations to understand information and make better decisions.</p><p>By supporting JengaHacks, PromptBI is investing in the next generation of builders who are exploring data, AI, and emerging technologies.</p><h2>More Sponsors Coming Soon</h2><p>We are actively working with additional partners and will be announcing more sponsors as they join JengaHacks 2026. Each new sponsor helps us expand opportunities, improve the event experience, and support more participants.</p><h2>Thank You to Our Partners</h2><p>We are grateful to our sponsors for believing in the JengaHacks mission. Their support helps create a space where learning, collaboration, and innovation can thrive.</p><p>If you are interested in sponsoring JengaHacks 2026, we would love to hear from you.</p>",
    "author": "JengaHacks Team",
    "publishedAt": "2025-12-10T14:30:00Z",
    "readTime": 3,
    "tags": ["sponsors", "partners"],
    "imageUrl": "/Desktop.jpeg"
  },
  {
    "id": "hackathon-tips-36-hours",
    "title": "Hackathon Tips: How to Make the Most of 36 Hours",
    "excerpt": "Expert advice on time management, team formation, and building a winning project at JengaHacks.",
    "content": "<p>Hackathons are intense, exciting, and incredibly rewarding experiences. With only 36 hours to build something from scratch, every minute counts. Whether you're a first-time hacker or a seasoned participant, these tips will help you make the most of your time at JengaHacks 2026.</p><h2>Before the Hackathon</h2><h3>1. Come Prepared</h3><p>While you can't code before the event starts, you can prepare:</p><ul><li><strong>Learn the basics:</strong> Brush up on common frameworks and tools you might use</li><li><strong>Set up your environment:</strong> Install necessary software, create accounts for APIs you might need</li><li><strong>Bring essentials:</strong> Laptop, charger, headphones, water bottle, and snacks</li><li><strong>Get rest:</strong> Sleep well the night before - you'll need your energy</li></ul><h3>2. Form or Join a Team</h3><p>While you can work solo, teams often produce better results:</p><ul><li>Find teammates with complementary skills (designer + developer + business person)</li><li>Discuss ideas beforehand, but be open to pivoting</li><li>If you're solo, attend team formation sessions at the event</li></ul><h2>During the Hackathon</h2><h3>1. Time Management is Everything</h3><p>Break down your 36 hours strategically:</p><ul><li><strong>Hours 0-2:</strong> Ideation and planning. Don't start coding immediately</li><li><strong>Hours 2-4:</strong> Set up your project structure, choose your tech stack</li><li><strong>Hours 4-30:</strong> Build, build, build (with breaks!)</li><li><strong>Hours 30-34:</strong> Polish, fix bugs, prepare demo</li><li><strong>Hours 34-36:</strong> Final touches and presentation prep</li></ul><h3>2. Start Simple, Then Iterate</h3><p>The best hackathon projects:</p><ul><li>Solve a real problem clearly</li><li>Have a working demo (even if basic)</li><li>Show potential for growth</li></ul><p>Don't try to build everything. Focus on one core feature that works well.</p><h3>3. Take Care of Yourself</h3><p>You can't code effectively if you're exhausted:</p><ul><li>Take regular breaks (every 1-2 hours)</li><li>Eat meals - don't skip them</li><li>Stay hydrated</li><li>Get some sleep if possible (even 2-3 hours helps)</li><li>Step outside for fresh air</li></ul><h3>4. Use Available Resources</h3><p>Don't struggle alone:</p><ul><li>Ask mentors for help when stuck</li><li>Attend workshops - they're designed to help you</li><li>Use office hours to unblock technical issues</li><li>Collaborate with other teams if appropriate</li></ul><h3>5. Focus on the Demo</h3><p>Remember: judges see your demo, not your code:</p><ul><li>Make sure your demo works smoothly</li><li>Prepare a clear, concise pitch (2-3 minutes)</li><li>Show the problem you're solving</li><li>Demonstrate your solution</li><li>Explain the impact and next steps</li></ul><h2>Common Pitfalls to Avoid</h2><ul><li><strong>Over-engineering:</strong> Don't build features you don't need</li><li><strong>Perfectionism:</strong> Done is better than perfect</li><li><strong>Working alone:</strong> Even if you're solo, ask for help</li><li><strong>Skipping breaks:</strong> Burnout kills productivity</li><li><strong>Ignoring the problem:</strong> Technology is a means, not the end</li></ul><h2>Final Tips</h2><ul><li><strong>Have fun:</strong> Hackathons are about learning and meeting people</li><li><strong>Network:</strong> Talk to other participants, mentors, and sponsors</li><li><strong>Document:</strong> Take notes, screenshots, and record your demo</li><li><strong>Be proud:</strong> Whatever you build in 36 hours is an achievement</li></ul><p>Remember: The goal isn't just to win prizes. It's to learn, build something meaningful, and have a great time doing it. Good luck, and we can't wait to see what you create!</p>",
    "author": "JengaHacks Team",
    "publishedAt": "2025-12-05T09:15:00Z",
    "readTime": 7,
    "tags": ["tips", "guide"],
    "videoUrl": "/Typing.mov"
  }
]
